# running in dcr/src/
read -formal -sv dcr.sv
read -formal -sv dcr_props.sv
read -formal -sv dcr_formal_top.sv
prep -top dcr_formal_top

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
